InformationRegisters/CRM_ДополнительнаяИнформацияПоАвтомобилям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ДополнительнаяИнформацияПоАвтомобилям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримечаниеРОП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПродажиРОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаОплатыАФМ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическаяДатаОплатыАФМ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаАФМСогласована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоОплаченАФМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентВнесАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентПолностьюОплатилАвто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеДляПродажи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветВыделенияСтрокиДляВсех</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПТСПолученДилером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладПТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыкупа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныВыкупаАвтоАФМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныеЗатратыПоАвто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка4</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка5</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка6</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка7</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка8</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка9</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка10</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаФиксирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродленнаяГарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SARA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодАвтомобиляВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Renault_Привилегированный/Ext/Module.bsl
Процедура ЗарегистрироватьДополнительнуюИнформациюПоАвтомобилям()Экспорт
	Узел = Константы.Renault_УзелРегистрацииИзмененийДанныхАФМ.Получить();
	Если ЗначениеЗаполнено(Узел) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.Автомобиль,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.Примечание,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ПримечаниеРОП,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ЦенаПродажиРОП,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ПлановаяДатаОплатыАФМ,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ОплатаАФМСогласована,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.АвтоОплаченАФМ,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.КлиентВнесАванс,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.КлиентПолностьюОплатилАвто,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.НеДляПродажи,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ЦветВыделенияСтрокиДляВсех,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ПТСПолученДилером,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ЖелаемаяДатаОтгрузки
	                      |ИЗ
	                      |	РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК CRM_ДополнительнаяИнформацияПоАвтомобилям");
		Выборка = Запрос.Выполнить().Выбрать();
		Набор = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьНаборЗаписей();
		Пока Выборка.Следующий() Цикл
			Набор.Отбор.Автомобиль.Значение = Выборка.Автомобиль;
			Набор.Отбор.Автомобиль.Использование = Истина;
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Набор);
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

Процедура ОтменитьРегистрациюДополнительнойИнформациюПоАвтомобилям(ТаблицаКОтмене = Неопределено)Экспорт
	Узел = Константы.Renault_УзелРегистрацииИзмененийДанныхАФМ.Получить();
	Если ЗначениеЗаполнено(Узел) Тогда
		Если ТаблицаКОтмене = Неопределено Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
		Иначе
			Набор = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьНаборЗаписей();
		    Для Каждого Запись Из ТаблицаКОтмене Цикл 
				Набор.Отбор.Автомобиль.Значение = Запись.Автомобиль;
				Набор.Отбор.Автомобиль.Использование = Истина;
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Набор);
			КонецЦикла;
        КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ИспользуетсяФункционалAdvanced() Экспорт
	Запрос=Новый Запрос("Выбрать 1 Из Справочник.Организации ГДЕ ИНН В(&СпИНН)");
	СпИНН=Новый Массив;
	СпИНН.Добавить("7813382729");
	СпИНН.Добавить("7718752313");
	Запрос.УстановитьПараметр("СпИНН",СпИНН);
	Возврат Не Запрос.Выполнить().Пустой()
КонецФункции
